tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j11_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F66J11_H_
#define _PIC18F66J11_H_

#define PMSTATL                       0
#define OB0E                          1
#define OB1E                          2
#define OB2E                          3
#define OB3E                          4
#define OBUF                          5
#define OBE                           6
#define PMSTATH                       7
#define IB0F                          8
#define IB1F                          9
#define IB2F                          10
#define IB3F                          11
#define IBOV                          12
#define IBF                           13
#define PMEL                          14
#define PTEN0                         15
#define PTENL                         16
#define PTEN1                         17
#define PTEN2                         18
#define PTEN3                         19
#define PTEN4                         20
#define PTEN5                         21
#define PTEN6                         22
#define PTEN7                         23
#define PMEH                          24
#define PTEN8                         25
#define PTENH                         26
#define PTEN9                         27
#define PTEN10                        28
#define PTEN11                        29
#define PTEN12                        30
#define PTEN13                        31
#define PTEN14                        32
#define PTEN15                        33
#define PMMODEL                       34
#define WAITE0                        35
#define WAITE                         36
#define WAITE1                        37
#define WAITM0                        38
#define WAITM                         39
#define WAITM1                        40
#define WAITM2                        41
#define WAITM3                        42
#define WAITB0                        43
#define WAITB                         44
#define WAITB1                        45
#define PMMODEH                       46
#define MODE0                         47
#define MODE                          48
#define MODE1                         49
#define MODE16                        50
#define INCM                          51
#define INCM0                         52
#define INCM1                         53
#define IRQM0                         54
#define IRQM                          55
#define IRQM1                         56
#define BUSY                          57
#define PMCONL                        58
#define RDSP                          59
#define WRSP                          60
#define BEP                           61
#define CS1P                          62
#define CS2P                          63
#define ALP                           64
#define CSF0                          65
#define CSF1                          66
#define PMCONH                        67
#define PTRDEN                        68
#define PTWREN                        69
#define PTBEEN                        70
#define ADRMUX0                       71
#define ADRMUX1                       72
#define PSIDL                         73
#define PMPEN                         74
#define PMADDRH                       75
#define ADDRH                         76
#define CS1                           77
#define CS2                           78
#define CMSTAT                        79
#define COUT1                         80
#define COUT2                         81
#define SSP2CON2                      82
#define SEN2                          83
#define SSP2CON2_SEN                  84
#define ADMSK12                       85
#define SSP2CON2_RSEN                 86
#define RSEN2                         87
#define SSP2CON2_ADMSK1               88
#define ADMSK22                       89
#define PEN2                          90
#define SSP2CON2_PEN                  91
#define SSP2CON2_ADMSK2               92
#define ADMSK32                       93
#define SSP2CON2_RCEN                 94
#define RCEN2                         95
#define SSP2CON2_ADMSK3               96
#define ACKEN2                        97
#define ADMSK42                       98
#define SSP2CON2_ADMSK4               99
#define SSP2CON2_ACKEN                100
#define ACKDT2                        101
#define ADMSK52                       102
#define SSP2CON2_ACKDT                103
#define SSP2CON2_ADMSK5               104
#define SSP2CON2_ACKSTAT              105
#define ACKSTAT2                      106
#define SSP2CON2_GCEN                 107
#define GCEN2                         108
#define SSP2CON1                      109
#define SSP2CON1_SSPM                 110
#define SSP2CON1_SSPM0                111
#define SSPM02                        112
#define SSPM12                        113
#define SSP2CON1_SSPM1                114
#define SSP2CON1_SSPM2                115
#define SSPM22                        116
#define SSPM32                        117
#define SSP2CON1_SSPM3                118
#define SSP2CON1_CKP                  119
#define CKP2                          120
#define SSPEN2                        121
#define SSP2CON1_SSPEN                122
#define SSPOV2                        123
#define SSP2CON1_SSPOV                124
#define WCOL2                         125
#define SSP2CON1_WCOL                 126
#define SSP2STAT                      127
#define SSP2STAT_BF                   128
#define BF2                           129
#define SSP2STAT_UA                   130
#define UA2                           131
#define SSP2STAT_R_W                  132
#define RW2                           133
#define SSP2STAT_R                    134
#define SSP2STAT_nWRITE               135
#define SSP2STAT_nW                   136
#define READ_WRITE2                   137
#define nW2                           138
#define SSP2STAT_I2C_READ             139
#define I2C_READ2                     140
#define SSP2STAT_R_NOT_W              141
#define R_nW2                         142
#define SSP2STAT_READ_WRITE           143
#define nWRITE2                       144
#define R_W2                          145
#define SSP2STAT_R_nW                 146
#define SSP2STAT_NOT_WRITE            147
#define SSP2STAT_S                    148
#define S2                            149
#define START2                        150
#define SSP2STAT_I2C_START            151
#define I2C_START2                    152
#define P2                            153
#define SSP2STAT_I2C_STOP             154
#define STOP2                         155
#define SSP2STAT_P                    156
#define I2C_STOP2                     157
#define I2C_DAT2                      158
#define SSP2STAT_D                    159
#define DATA_ADDRESS2                 160
#define SSP2STAT_D_NOT_A              161
#define SSP2STAT_I2C_DAT              162
#define D_A2                          163
#define SSP2STAT_NOT_ADDRESS          164
#define SSP2STAT_D_nA                 165
#define SSP2STAT_DATA_ADDRESS         166
#define SSP2STAT_nADDRESS             167
#define nA2                           168
#define DA2                           169
#define nADDRESS2                     170
#define SSP2STAT_nA                   171
#define SSP2STAT_D_A                  172
#define D_nA2                         173
#define SSP2STAT_CKE                  174
#define CKE2                          175
#define SSP2STAT_SMP                  176
#define SMP2                          177
#define SSP2ADD                       178
#define MSK02                         179
#define MSK12                         180
#define MSK22                         181
#define MSK32                         182
#define MSK42                         183
#define MSK52                         184
#define MSK62                         185
#define MSK72                         186
#define SSP2MSK                       187
#define SSP2MSK_MSK0                  188
#define SSP2MSK_MSK1                  189
#define SSP2MSK_MSK2                  190
#define SSP2MSK_MSK3                  191
#define SSP2MSK_MSK4                  192
#define SSP2MSK_MSK5                  193
#define SSP2MSK_MSK6                  194
#define SSP2MSK_MSK7                  195
#define CCP5CON                       196
#define CCP5M0                        197
#define CCP5M                         198
#define CCP5M1                        199
#define CCP5M2                        200
#define CCP5M3                        201
#define DCCP5Y                        202
#define DC5B0                         203
#define DC5B                          204
#define DC5B1                         205
#define DCCP5X                        206
#define CCP4CON                       207
#define CCP4M                         208
#define CCP4M0                        209
#define CCP4M1                        210
#define CCP4M2                        211
#define CCP4M3                        212
#define DCCP4Y                        213
#define DC4B0                         214
#define DC4B                          215
#define DCCP4X                        216
#define DC4B1                         217
#define T4CON                         218
#define T4CKPS0                       219
#define T4CKPS                        220
#define T4CKPS1                       221
#define TMR4ON                        222
#define T4OUTPS                       223
#define T4OUTPS0                      224
#define T4OUTPS1                      225
#define T4OUTPS2                      226
#define T4OUTPS3                      227
#define CVRCON                        228
#define CVR                           229
#define CVR0                          230
#define CVR1                          231
#define CVR2                          232
#define CVR3                          233
#define CVRSS                         234
#define CVRR                          235
#define CVROEN                        236
#define CVROE                         237
#define CVREN                         238
#define T3CON                         239
#define TMR3ON                        240
#define TMR3CS                        241
#define nT3SYNC                       242
#define NOT_T3SYNC                    243
#define T3SYNC                        244
#define T3INSYNC                      245
#define SOSCEN3                       246
#define T3CCP1                        247
#define T3CKPS                        248
#define T3CKPS0                       249
#define T3CKPS1                       250
#define T3CCP2                        251
#define T3CON_RD16                    252
#define RD163                         253
#define T3RD16                        254
#define BAUDCON2                      255
#define BAUDCON2_ABDEN                256
#define ABDEN2                        257
#define WUE2                          258
#define BAUDCON2_WUE                  259
#define BRG162                        260
#define BAUDCON2_BRG16                261
#define BAUDCON2_SCKP                 262
#define SCKP2                         263
#define BAUDCON2_TXCKP                264
#define TXCKP2                        265
#define DTRXP2                        266
#define RXDTP2                        267
#define BAUDCON2_DTRXP                268
#define BAUDCON2_RXDTP                269
#define RCMT2                         270
#define RCIDL2                        271
#define BAUDCON2_RCIDL                272
#define BAUDCON2_RCMT                 273
#define BAUDCON2_ABDOVF               274
#define ABDOVF2                       275
#define BAUDCON1                      276
#define BAUDCON1_ABDEN                277
#define ABDEN1                        278
#define BAUDCON1_WUE                  279
#define WUE1                          280
#define W4E                           281
#define BRG161                        282
#define BAUDCON1_BRG16                283
#define CKTXP                         284
#define BAUDCON1_TXCKP                285
#define SCKP1                         286
#define BAUDCON1_SCKP                 287
#define TXCKP1                        288
#define DTRXP1                        289
#define RXDTP1                        290
#define RXCKP                         291
#define BAUDCON1_DTRXP                292
#define BAUDCON1_RXDTP                293
#define BAUDCON1_RCMT                 294
#define RCMT1                         295
#define RCIDL1                        296
#define BAUDCON1_RCIDL                297
#define ABDOVF1                       298
#define BAUDCON1_ABDOVF               299
#define PORTA                         300
#define AN0                           301
#define ULPWUIN                       302
#define PORTA_RA0                     303
#define AN1                           304
#define PORTA_RA1                     305
#define AN2                           306
#define PORTA_RA2                     307
#define VREFM                         308
#define AN3                           309
#define PORTA_RA3                     310
#define VREFP                         311
#define PORTA_RA4                     312
#define T0CKI                         313
#define AN4                           314
#define PORTA_RA5                     315
#define LVDIN                         316
#define CLKO                          317
#define PORTA_RA6                     318
#define OSC2                          319
#define PORTA_RA7                     320
#define RJPU                          321
#define PORTB                         322
#define FLT0                          323
#define INT0                          324
#define PORTB_RB0                     325
#define PMA4                          326
#define INT1                          327
#define PORTB_RB1                     328
#define PMA3                          329
#define INT2                          330
#define PORTB_RB2                     331
#define PMA2                          332
#define INT3                          333
#define CCP2_PA2                      334
#define PORTB_RB3                     335
#define PMA1                          336
#define KBI0                          337
#define PORTB_RB4                     338
#define PMA0                          339
#define KBI1                          340
#define PORTB_RB5                     341
#define PGC                           342
#define KBI2                          343
#define PORTB_RB6                     344
#define PGD                           345
#define KBI3                          346
#define PORTB_RB7                     347
#define PORTC                         348
#define T13CKI                        349
#define T1OSO                         350
#define PORTC_RC0                     351
#define PORTC_CCP2                    352
#define T1OSI                         353
#define PA2                           354
#define PORTC_RC1                     355
#define CCP1                          356
#define PA1                           357
#define PORTC_RC2                     358
#define SCL                           359
#define SCK                           360
#define PORTC_RC3                     361
#define SDA                           362
#define SDI                           363
#define PORTC_RC4                     364
#define SDO                           365
#define PORTC_RC5                     366
#define TX                            367
#define CK                            368
#define PORTC_RC6                     369
#define DT                            370
#define RX                            371
#define PORTC_RC7                     372
#define PORTD                         373
#define PORTD_RD0                     374
#define PMD0                          375
#define PORTD_RD1                     376
#define PMD1                          377
#define PORTD_RD2                     378
#define PMD2                          379
#define PORTD_RD3                     380
#define PMD3                          381
#define SDO2                          382
#define PORTD_RD4                     383
#define PMD4                          384
#define SDI2                          385
#define SDA2                          386
#define PORTD_RD5                     387
#define PMD5                          388
#define SCK2                          389
#define SCL2                          390
#define PORTD_RD6                     391
#define PMD6                          392
#define SS2                           393
#define PORTD_RD7                     394
#define PMD7                          395
#define PORTE                         396
#define PMRD                          397
#define PD2                           398
#define RDE                           399
#define PORTE_RE0                     400
#define PMWR                          401
#define WRE                           402
#define PORTE_RE1                     403
#define PC2                           404
#define PMBE                          405
#define CCP10                         406
#define PB2                           407
#define CS                            408
#define PORTE_RE2                     409
#define CCP9E                         410
#define PMA13                         411
#define REFO                          412
#define PORTE_RE3                     413
#define PC3E                          414
#define PB3E                          415
#define PMA12                         416
#define PORTE_RE4                     417
#define CCP8E                         418
#define PMA11                         419
#define CCP7E                         420
#define PORTE_RE5                     421
#define PC1E                          422
#define CCP6E                         423
#define PMA10                         424
#define PORTE_RE6                     425
#define PB1E                          426
#define PORTE_CCP2                    427
#define CCP2E                         428
#define PORTE_RE7                     429
#define PMA9                          430
#define PA2E                          431
#define PORTF                         432
#define PORTF_RF1                     433
#define C2OUTF                        434
#define AN6                           435
#define C2OUT                         436
#define AN7                           437
#define C1OUTF                        438
#define C1OUT                         439
#define PORTF_RF2                     440
#define PMA5                          441
#define PORTF_RF3                     442
#define AN8                           443
#define C2INB                         444
#define PORTF_RF4                     445
#define AN9                           446
#define C2INA                         447
#define C1INB                         448
#define PORTF_RF5                     449
#define CVREF                         450
#define AN10                          451
#define C1INA                         452
#define PORTF_RF6                     453
#define AN11                          454
#define PORTF_RF7                     455
#define SS                            456
#define PORTG                         457
#define PMA8                          458
#define CCP3                          459
#define PORTG_RG0                     460
#define PMA7                          461
#define C3OUTG                        462
#define TX2                           463
#define PORTG_RG1                     464
#define CK2                           465
#define PMA6                          466
#define RX2                           467
#define PORTG_RG2                     468
#define DT2                           469
#define PMCS1                         470
#define CCP4                          471
#define PORTG_RG3                     472
#define PMCS2                         473
#define CCP5                          474
#define PORTG_RG4                     475
#define REPU                          476
#define RG6                           477
#define RDPU                          478
#define RG7                           479
#define LATA                          480
#define LATA0                         481
#define LA0                           482
#define LATA1                         483
#define LA1                           484
#define LATA2                         485
#define LA2                           486
#define LATA3                         487
#define LA3                           488
#define LATA4                         489
#define LA4                           490
#define LATA5                         491
#define LA5                           492
#define LATA6                         493
#define LA6                           494
#define LATA7                         495
#define LA7                           496
#define LATB                          497
#define LB0                           498
#define LATB0                         499
#define LB1                           500
#define LATB1                         501
#define LB2                           502
#define LATB2                         503
#define LB3                           504
#define LATB3                         505
#define LB4                           506
#define LATB4                         507
#define LB5                           508
#define LATB5                         509
#define LB6                           510
#define LATB6                         511
#define LB7                           512
#define LATB7                         513
#define LATC                          514
#define LATC0                         515
#define LC0                           516
#define LATC1                         517
#define LC1                           518
#define LATC2                         519
#define LC2                           520
#define LATC3                         521
