tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j11_tdd.h
#define LC3                           522
#define LATC4                         523
#define LC4                           524
#define LATC5                         525
#define LC5                           526
#define LATC6                         527
#define LC6                           528
#define LATC7                         529
#define LC7                           530
#define LATD                          531
#define LATD0                         532
#define LD0                           533
#define LATD1                         534
#define LD1                           535
#define LATD2                         536
#define LD2                           537
#define LATD3                         538
#define LD3                           539
#define LATD4                         540
#define LD4                           541
#define LATD5                         542
#define LD5                           543
#define LATD6                         544
#define LD6                           545
#define LATD7                         546
#define LD7                           547
#define LATE                          548
#define LATE0                         549
#define LE0                           550
#define LATE1                         551
#define LE1                           552
#define LATE2                         553
#define LE2                           554
#define LATE3                         555
#define LE3                           556
#define LATE4                         557
#define LE4                           558
#define LATE5                         559
#define LE5                           560
#define LATE6                         561
#define LE6                           562
#define LATE7                         563
#define LE7                           564
#define LATF                          565
#define LATF1                         566
#define LF1                           567
#define LF2                           568
#define LATF2                         569
#define LF3                           570
#define LATF3                         571
#define LF4                           572
#define LATF4                         573
#define LF5                           574
#define LATF5                         575
#define LF6                           576
#define LATF6                         577
#define LF7                           578
#define LATF7                         579
#define LATG                          580
#define LATG0                         581
#define LG0                           582
#define LATG1                         583
#define LG1                           584
#define LATG2                         585
#define LG2                           586
#define LATG3                         587
#define LG3                           588
#define LATG4                         589
#define LG4                           590
#define TRISA                         591
#define TRISA0                        592
#define TRISA_RA0                     593
#define TRISA1                        594
#define TRISA_RA1                     595
#define TRISA2                        596
#define TRISA_RA2                     597
#define TRISA3                        598
#define TRISA_RA3                     599
#define TRISA_RA4                     600
#define TRISA4                        601
#define TRISA_RA5                     602
#define TRISA5                        603
#define TRISA_RA6                     604
#define TRISA6                        605
#define TRISA_RA7                     606
#define TRISA7                        607
#define TRISB                         608
#define TRISB_RB0                     609
#define TRISB0                        610
#define TRISB_RB1                     611
#define TRISB1                        612
#define TRISB_RB2                     613
#define TRISB2                        614
#define TRISB_RB3                     615
#define TRISB3                        616
#define TRISB_RB4                     617
#define TRISB4                        618
#define TRISB_RB5                     619
#define TRISB5                        620
#define TRISB_RB6                     621
#define TRISB6                        622
#define TRISB_RB7                     623
#define TRISB7                        624
#define TRISC                         625
#define TRISC0                        626
#define TRISC_RC0                     627
#define TRISC1                        628
#define TRISC_RC1                     629
#define TRISC2                        630
#define TRISC_RC2                     631
#define TRISC3                        632
#define TRISC_RC3                     633
#define TRISC4                        634
#define TRISC_RC4                     635
#define TRISC5                        636
#define TRISC_RC5                     637
#define TRISC6                        638
#define TRISC_RC6                     639
#define TRISC7                        640
#define TRISC_RC7                     641
#define TRISD                         642
#define TRISD_RD0                     643
#define TRISD0                        644
#define TRISD_RD1                     645
#define TRISD1                        646
#define TRISD_RD2                     647
#define TRISD2                        648
#define TRISD_RD3                     649
#define TRISD3                        650
#define TRISD_RD4                     651
#define TRISD4                        652
#define TRISD_RD5                     653
#define TRISD5                        654
#define TRISD_RD6                     655
#define TRISD6                        656
#define TRISD_RD7                     657
#define TRISD7                        658
#define TRISE                         659
#define TRISE_RE0                     660
#define TRISE0                        661
#define TRISE1                        662
#define TRISE_RE1                     663
#define TRISE2                        664
#define TRISE_RE2                     665
#define TRISE_RE3                     666
#define TRISE3                        667
#define TRISE_RE4                     668
#define TRISE4                        669
#define TRISE_RE5                     670
#define TRISE5                        671
#define TRISE_RE6                     672
#define TRISE6                        673
#define TRISE_RE7                     674
#define TRISE7                        675
#define TRISF                         676
#define TRISF_RF1                     677
#define TRISF1                        678
#define TRISF2                        679
#define TRISF_RF2                     680
#define TRISF_RF3                     681
#define TRISF3                        682
#define TRISF_RF4                     683
#define TRISF4                        684
#define TRISF_RF5                     685
#define TRISF5                        686
#define TRISF_RF6                     687
#define TRISF6                        688
#define TRISF7                        689
#define TRISF_RF7                     690
#define TRISG                         691
#define TRISG0                        692
#define TRISG_RG0                     693
#define TRISG1                        694
#define TRISG_RG1                     695
#define TRISG2                        696
#define TRISG_RG2                     697
#define TRISG_RG3                     698
#define TRISG3                        699
#define TRISG4                        700
#define TRISG_RG4                     701
#define OSCTUNE                       702
#define TUN0                          703
#define TUN1                          704
#define TUN2                          705
#define TUN3                          706
#define TUN4                          707
#define TUN5                          708
#define PLLEN                         709
#define INTSRC                        710
#define RCSTA2                        711
#define RCD82                         712
#define RX9D2                         713
#define RCSTA2_RCD8                   714
#define RCSTA2_RX9D                   715
#define RCSTA2_OERR                   716
#define OERR2                         717
#define FERR2                         718
#define RCSTA2_FERR                   719
#define ADDEN2                        720
#define RCSTA2_ADDEN                  721
#define RCSTA2_CREN                   722
#define CREN2                         723
#define SREN2                         724
#define RCSTA2_SREN                   725
#define RC92                          726
#define RCSTA2_nRC8                   727
#define RC8_92                        728
#define RCSTA2_RX9                    729
#define RCSTA2_NOT_RC8                730
#define RCSTA2_RC9                    731
#define RCSTA2_RC8_9                  732
#define RX92                          733
#define RCSTA2_SPEN                   734
#define SPEN2                         735
#define PIE1                          736
#define TMR1IE                        737
#define TMR2IE                        738
#define CCP1IE                        739
#define SSP1IE                        740
#define SSPIE                         741
#define TXIE                          742
#define TX1IE                         743
#define RC1IE                         744
#define RCIE                          745
#define ADIE                          746
#define PSPIE                         747
#define PMPIE                         748
#define PIR1                          749
#define TMR1IF                        750
#define TMR2IF                        751
#define CCP1IF                        752
#define SSPIF                         753
#define SSP1IF                        754
#define TXIF                          755
#define TX1IF                         756
#define RCIF                          757
#define RC1IF                         758
#define ADIF                          759
#define PSPIF                         760
#define PMPIF                         761
#define IPR1                          762
#define TMR1IP                        763
#define TMR2IP                        764
#define CCP1IP                        765
#define SSPIP                         766
#define SSP1IP                        767
#define TX1IP                         768
#define TXIP                          769
#define RCIP                          770
#define RC1IP                         771
#define ADIP                          772
#define PMPIP                         773
#define PSPIP                         774
#define PIE2                          775
#define CCP2IE                        776
#define TMR3IE                        777
#define LVDIE                         778
#define BCL1IE                        779
#define BCLIE                         780
#define CM1IE                         781
#define CMIE                          782
#define CM2IE                         783
#define OSCFIE                        784
#define PIR2                          785
#define CCP2IF                        786
#define TMR3IF                        787
#define LVDIF                         788
#define BCL1IF                        789
#define BCLIF                         790
#define CM1IF                         791
#define CMIF                          792
#define CM2IF                         793
#define OSCFIF                        794
#define IPR2                          795
#define CCP2IP                        796
#define TMR3IP                        797
#define LVDIP                         798
#define BCLIP                         799
#define BCL1IP                        800
#define CM1IP                         801
#define CM2IP                         802
#define CMIP                          803
#define OSCFIP                        804
#define PIE3                          805
#define CCP3IE                        806
#define RXB0IE                        807
#define RXBNIE                        808
#define RXB1IE                        809
#define CCP4IE                        810
#define TXB0IE                        811
#define CCP5IE                        812
#define TXB1IE                        813
#define TMR4IE                        814
#define TXB2IE                        815
#define TXBNIE                        816
#define TX2IE                         817
#define RC2IE                         818
#define BCL2IE                        819
#define SSP2IE                        820
#define PIR3                          821
#define CCP3IF                        822
#define RXBNIF                        823
#define CCP4IF                        824
#define CCP5IF                        825
#define TMR4IF                        826
#define TXBNIF                        827
#define TX2IF                         828
#define RC2IF                         829
#define BCL2IF                        830
#define SSP2IF                        831
#define IPR3                          832
#define CCP3IP                        833
#define CCP4IP                        834
#define RXBNIP                        835
#define CCP5IP                        836
#define TMR4IP                        837
#define TX2IP                         838
#define TXBNIP                        839
#define RC2IP                         840
#define BCL2IP                        841
#define SSP2IP                        842
#define EECON1                        843
#define WR                            844
#define WREN                          845
#define WRERR                         846
#define FREE                          847
#define WPROG                         848
#define TXSTA2                        849
#define TXSTA2_TXD8                   850
#define TX9D2                         851
#define TXSTA2_TX9D                   852
#define TXD82                         853
#define TRMT2                         854
#define TXSTA2_TRMT                   855
#define BRGH2                         856
#define TXSTA2_BRGH                   857
#define SENDB2                        858
#define TXSTA2_SENDB                  859
#define TXSTA2_SYNC                   860
#define SYNC2                         861
#define TXEN2                         862
#define TXSTA2_TXEN                   863
#define TX8_92                        864
#define TX92                          865
#define TXSTA2_TX9                    866
#define TXSTA2_nTX8                   867
#define TXSTA2_NOT_TX8                868
#define TXSTA2_TX8_9                  869
#define TXSTA2_CSRC                   870
#define CSRC2                         871
#define RCSTA1                        872
#define RCSTA1_RX9D                   873
#define RX9D1                         874
#define RCSTA1_RCD8                   875
#define RCSTA1_OERR                   876
#define OERR1                         877
#define RCSTA1_FERR                   878
#define FERR1                         879
#define RCSTA1_ADDEN                  880
#define ADDEN1                        881
#define RCSTA1_CREN                   882
#define CREN1                         883
#define SRENA                         884
#define SREN1                         885
#define RCSTA1_SREN                   886
#define RCSTA1_NOT_RC8                887
#define RCSTA1_RC9                    888
#define RCSTA1_nRC8                   889
#define RCSTA1_RC8_9                  890
#define RCSTA1_RX9                    891
#define RX91                          892
#define RCSTA1_SPEN                   893
#define SPEN1                         894
#define TXSTA1                        895
#define TX9D1                         896
#define TXSTA1_TX9D                   897
#define TXSTA1_TXD8                   898
#define TRMT1                         899
#define TXSTA1_TRMT                   900
#define BRGH1                         901
#define TXSTA1_BRGH                   902
#define TXSTA1_SENDB                  903
#define SENDB1                        904
#define TXSTA1_SYNC                   905
#define SYNC1                         906
#define TXEN1                         907
#define TXSTA1_TXEN                   908
#define TX91                          909
#define TXSTA1_NOT_TX8                910
#define TXSTA1_TX8_9                  911
#define TXSTA1_TX9                    912
#define TXSTA1_nTX8                   913
#define TXSTA1_CSRC                   914
#define CSRC1                         915
#define ECCP3CON                      916
#define CCP3M                         917
#define CCP3M0                        918
#define CCP3M1                        919
#define CCP3M2                        920
#define CCP3M3                        921
#define CCP3Y                         922
#define DC3B                          923
#define DC3B0                         924
#define DC3B1                         925
#define CCP3X                         926
#define P3M                           927
#define P3M0                          928
#define P3M1                          929
#define ECCP3DEL                      930
#define ECCP3DEL_PDC0                 931
#define P3DC0                         932
#define ECCP3DEL_PDC                  933
#define ECCP3DEL_PDC1                 934
#define P3DC1                         935
#define ECCP3DEL_PDC2                 936
#define P3DC2                         937
#define ECCP3DEL_PDC3                 938
#define P3DC3                         939
#define ECCP3DEL_PDC4                 940
#define P3DC4                         941
#define ECCP3DEL_PDC5                 942
#define P3DC5                         943
#define ECCP3DEL_PDC6                 944
#define P3DC6                         945
#define P3RSEN                        946
#define ECCP3DEL_PRSEN                947
#define ECCP3AS                       948
#define ECCP3AS_PSSBD0                949
#define PSS3BD0                       950
#define ECCP3AS_PSSBD                 951
#define ECCP3AS_PSSBD1                952
#define PSS3BD1                       953
#define ECCP3AS_PSSAC0                954
#define PSS3AC0                       955
#define ECCP3AS_PSSAC                 956
#define ECCP3AS_PSSAC1                957
#define PSS3AC1                       958
#define ECCP3AS_ECCPAS0               959
#define ECCP3AS_ECCPAS                960
#define ECCP3AS0                      961
#define ECCP3AS_ECCPAS1               962
#define ECCP3AS1                      963
#define ECCP3AS_ECCPAS2               964
#define ECCP3AS2                      965
#define ECCP3AS_ECCPASE               966
#define ECCP3ASE                      967
#define ECCP2CON                      968
#define CCP2M                         969
#define CCP2M0                        970
#define CCP2M1                        971
#define CCP2M2                        972
#define CCP2M3                        973
#define DC2B                          974
#define DC2B0                         975
#define CCP2Y                         976
#define DC2B1                         977
#define CCP2X                         978
#define P2M                           979
#define P2M0                          980
#define P2M1                          981
#define ECCP2DEL                      982
#define P2DC0                         983
#define ECCP2DEL_PDC0                 984
#define ECCP2DEL_PDC                  985
#define P2DC1                         986
#define ECCP2DEL_PDC1                 987
#define P2DC2                         988
#define ECCP2DEL_PDC2                 989
#define P2DC3                         990
#define ECCP2DEL_PDC3                 991
#define P2DC4                         992
#define ECCP2DEL_PDC4                 993
#define P2DC5                         994
#define ECCP2DEL_PDC5                 995
#define P2DC6                         996
#define ECCP2DEL_PDC6                 997
#define ECCP2DEL_PRSEN                998
#define P2RSEN                        999
#define ECCP2AS                       1000
#define ECCP2AS_PSSBD                 1001
#define ECCP2AS_PSSBD0                1002
#define PSS2BD0                       1003
#define ECCP2AS_PSSBD1                1004
#define PSS2BD1                       1005
#define PSS2AC0                       1006
#define ECCP2AS_PSSAC0                1007
#define ECCP2AS_PSSAC                 1008
#define ECCP2AS_PSSAC1                1009
#define PSS2AC1                       1010
#define ECCP2AS_ECCPAS                1011
#define ECCP2AS0                      1012
#define ECCP2AS_ECCPAS0               1013
#define ECCP2AS1                      1014
#define ECCP2AS_ECCPAS1               1015
#define ECCP2AS2                      1016
#define ECCP2AS_ECCPAS2               1017
#define ECCP2AS_ECCPASE               1018
#define ECCP2ASE                      1019
#define ECCP1CON                      1020
#define CCP1M0                        1021
#define CCP1M                         1022
#define CCP1M1                        1023
#define CCP1M2                        1024
#define CCP1M3                        1025
#define CCP1Y                         1026
#define DC1B                          1027
#define DC1B0                         1028
#define CCP1X                         1029
#define DC1B1                         1030
#define P1M                           1031
#define P1M0                          1032
#define P1M1                          1033
#define ECCP1DEL                      1034
#define P1DC0                         1035
#define ECCP1DEL_PDC0                 1036
#define ECCP1DEL_PDC                  1037
#define P1DC1                         1038
#define ECCP1DEL_PDC1                 1039
#define P1DC2                         1040
#define ECCP1DEL_PDC2                 1041
#define P1DC3                         1042
#define ECCP1DEL_PDC3                 1043
#define P1DC4                         1044
#define ECCP1DEL_PDC4                 1045
#define P1DC5                         1046
#define ECCP1DEL_PDC5                 1047
#define P1DC6                         1048
#define ECCP1DEL_PDC6                 1049
#define P1RSEN                        1050
#define ECCP1DEL_PRSEN                1051
#define ECCP1AS                       1052
#define ECCP1AS_PSSBD                 1053
#define ECCP1AS_PSSBD0                1054
#define PSS1BD0                       1055
#define ECCP1AS_PSSBD1                1056
#define PSS1BD1                       1057
#define ECCP1AS_PSSAC0                1058
#define PSS1AC0                       1059
#define ECCP1AS_PSSAC                 1060
#define ECCP1AS_PSSAC1                1061
#define PSS1AC1                       1062
#define ECCP1AS_ECCPAS0               1063
#define ECCP1AS_ECCPAS                1064
#define ECCP1AS0                      1065
#define ECCP1AS_ECCPAS1               1066
#define ECCP1AS1                      1067
#define ECCP1AS_ECCPAS2               1068
#define ECCP1AS2                      1069
#define ECCP1ASE                      1070
#define ECCP1AS_ECCPASE               1071
#define WDTCON                        1072
#define SWDTEN                        1073
#define SWDTE                         1074
#define ADSHR                         1075
#define DEVCFG                        1076
#define LVDSTAT                       1077
#define REGSLP                        1078
#define ANCON0                        1079
#define PCFGL                         1080
#define PCFG0                         1081
#define PCFG1                         1082
#define PCFG2                         1083
#define PCFG3                         1084
#define PCFG4                         1085
#define PCFG5                         1086
#define PCFG6                         1087
#define PCFG7                         1088
#define ADCON1                        1089
#define ADCS0                         1090
