tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j11_tdd.h
#define ADCS                          1091
#define ADCS1                         1092
#define ADCS2                         1093
#define ACQT0                         1094
#define ACQT                          1095
#define CHSN3                         1096
#define ACQT1                         1097
#define VCFG01                        1098
#define ACQT2                         1099
#define VCFG11                        1100
#define ADCON1_ADCAL                  1101
#define ADFM                          1102
#define ANCON1                        1103
#define PCFGH                         1104
#define PCFG8                         1105
#define PCFG9                         1106
#define PCFG10                        1107
#define PCFG11                        1108
#define PCFG12                        1109
#define PCFG13                        1110
#define PCFG14                        1111
#define PCFG15                        1112
#define ADCON0                        1113
#define ADON                          1114
#define GO_nDONE                      1115
#define NOT_DONE                      1116
#define GODONE                        1117
#define GO_DONE                       1118
#define DONE                          1119
#define GO                            1120
#define GO_NOT_DONE                   1121
#define CHS                           1122
#define CHS0                          1123
#define CHS1                          1124
#define CHS2                          1125
#define CHS3                          1126
#define VCFG                          1127
#define VCFG0                         1128
#define VCFG1                         1129
#define ADCON0_ADCAL                  1130
#define SSP1CON2                      1131
#define SEN1                          1132
#define SSP1CON2_SEN                  1133
#define ADMSK11                       1134
#define SSP1CON2_RSEN                 1135
#define RSEN1                         1136
#define SSP1CON2_ADMSK1               1137
#define SSP1CON2_PEN                  1138
#define ADMSK21                       1139
#define PEN1                          1140
#define SSP1CON2_ADMSK2               1141
#define ADMSK31                       1142
#define RCEN1                         1143
#define SSP1CON2_RCEN                 1144
#define SSP1CON2_ADMSK3               1145
#define SSP1CON2_ACKEN                1146
#define ACKEN1                        1147
#define ADMSK41                       1148
#define SSP1CON2_ADMSK4               1149
#define ACKDT1                        1150
#define ADMSK51                       1151
#define SSP1CON2_ACKDT                1152
#define SSP1CON2_ADMSK5               1153
#define SSP1CON2_ACKSTAT              1154
#define ACKSTAT1                      1155
#define GCEN1                         1156
#define SSP1CON2_GCEN                 1157
#define SSP1CON1                      1158
#define SSP1CON1_SSPM0                1159
#define SSPM01                        1160
#define SSP1CON1_SSPM                 1161
#define SSP1CON1_SSPM1                1162
#define SSPM11                        1163
#define SSP1CON1_SSPM2                1164
#define SSPM21                        1165
#define SSPM31                        1166
#define SSP1CON1_SSPM3                1167
#define SSP1CON1_CKP                  1168
#define CKP1                          1169
#define SSPEN1                        1170
#define SSP1CON1_SSPEN                1171
#define SSPOV1                        1172
#define SSP1CON1_SSPOV                1173
#define WCOL1                         1174
#define SSP1CON1_WCOL                 1175
#define SSP1STAT                      1176
#define BF1                           1177
#define SSP1STAT_BF                   1178
#define UA1                           1179
#define SSP1STAT_UA                   1180
#define SSP1STAT_R_NOT_W              1181
#define RW1                           1182
#define NOT_W                         1183
#define SSP1STAT_R                    1184
#define SSP1STAT_nW                   1185
#define RW                            1186
#define SSP1STAT_READ_WRITE           1187
#define SSP1STAT_nWRITE               1188
#define SSP1STAT_I2C_READ             1189
#define SSP1STAT_R_W                  1190
#define SSP1STAT_NOT_WRITE            1191
#define SSP1STAT_R_nW                 1192
#define SSP1STAT_S                    1193
#define START                         1194
#define START1                        1195
#define SSP1STAT_I2C_START            1196
#define STOP                          1197
#define SSP1STAT_P                    1198
#define STOP1                         1199
#define SSP1STAT_I2C_STOP             1200
#define SSP1STAT_D                    1201
#define SSP1STAT_D_NOT_A              1202
#define NOT_A                         1203
#define SSP1STAT_D_A                  1204
#define SSP1STAT_D_nA                 1205
#define SSP1STAT_NOT_ADDRESS          1206
#define SSP1STAT_nA                   1207
#define DA1                           1208
#define DA                            1209
#define SSP1STAT_nADDRESS             1210
#define SSP1STAT_I2C_DAT              1211
#define SSP1STAT_DATA_ADDRESS         1212
#define SSP1STAT_CKE                  1213
#define CKE1                          1214
#define SSP1STAT_SMP                  1215
#define SMP1                          1216
#define SSP1ADD                       1217
#define SSP1ADD_MSK0                  1218
#define MSK01                         1219
#define SSP1ADD_MSK1                  1220
#define MSK11                         1221
#define SSP1ADD_MSK2                  1222
#define MSK21                         1223
#define MSK31                         1224
#define SSP1ADD_MSK3                  1225
#define SSP1ADD_MSK4                  1226
#define MSK41                         1227
#define MSK51                         1228
#define SSP1ADD_MSK5                  1229
#define SSP1ADD_MSK6                  1230
#define MSK61                         1231
#define SSP1ADD_MSK7                  1232
#define MSK71                         1233
#define SSP1MSK                       1234
#define SSP1MSK_MSK0                  1235
#define SSP1MSK_MSK1                  1236
#define SSP1MSK_MSK2                  1237
#define SSP1MSK_MSK3                  1238
#define SSP1MSK_MSK4                  1239
#define SSP1MSK_MSK5                  1240
#define SSP1MSK_MSK6                  1241
#define SSP1MSK_MSK7                  1242
#define T2CON                         1243
#define T2CKPS0                       1244
#define T2CKPS                        1245
#define T2CKPS1                       1246
#define TMR2ON                        1247
#define T2OUTPS0                      1248
#define TOUTPS                        1249
#define T2OUTPS1                      1250
#define T2OUTPS2                      1251
#define T2OUTPS3                      1252
#define PR2                           1253
#define WM0                           1254
#define WM1                           1255
#define WAIT0                         1256
#define WAIT1                         1257
#define EBDIS                         1258
#define PADCFG1                       1259
#define PMPTL                         1260
#define PMPTTL                        1261
#define ODCON3                        1262
#define SPI1OD                        1263
#define SPI2OD                        1264
#define T1CON                         1265
#define TMR1ON                        1266
#define TMR1CS                        1267
#define NOT_T1SYNC                    1268
#define T1SYNC                        1269
#define nT1SYNC                       1270
#define T1INSYNC                      1271
#define T1OSCEN                       1272
#define SOSCEN                        1273
#define T1CKPS0                       1274
#define T1CKPS                        1275
#define T1CKPS1                       1276
#define T1RUN                         1277
#define T1RD16                        1278
#define T1CON_RD16                    1279
#define ODCON2                        1280
#define USART1OD                      1281
#define U1OD                          1282
#define U2OD                          1283
#define USART2OD                      1284
#define ODCON1                        1285
#define ECCP1OD                       1286
#define ECCP2OD                       1287
#define ECCP3OD                       1288
#define CCP4OD                        1289
#define CCP5OD                        1290
#define RCON                          1291
#define BOR                           1292
#define NOT_BOR                       1293
#define nBOR                          1294
#define POR                           1295
#define nPOR                          1296
#define NOT_POR                       1297
#define PD                            1298
#define nPD                           1299
#define NOT_PD                        1300
#define nTO                           1301
#define TO                            1302
#define NOT_TO                        1303
#define nRI                           1304
#define NOT_RI                        1305
#define RI                            1306
#define NOT_CM                        1307
#define CM                            1308
#define nCM                           1309
#define IPEN                          1310
#define CM2CON1                       1311
#define CM2CON1_C1CH0                 1312
#define CM2CON1_CCH                   1313
#define CM2CON1_CCH0                  1314
#define CCH02                         1315
#define CM2CON1_C1CH1                 1316
#define CCH12                         1317
#define CM2CON1_CCH1                  1318
#define CM2CON1_CREF                  1319
#define CREF2                         1320
#define EVPOL02                       1321
#define CM2CON1_EVPOL0                1322
#define CM2CON1_EVPOL                 1323
#define CM2CON1_EVPOL1                1324
#define EVPOL12                       1325
#define CM2CON1_CPOL                  1326
#define CPOL2                         1327
#define COE2                          1328
#define CM2CON1_COE                   1329
#define CM2CON1_CON                   1330
#define CON2                          1331
#define CM1CON1                       1332
#define CM1CON1_CCH0                  1333
#define CM1CON1_CCH                   1334
#define CCH01                         1335
#define CM1CON1_C1CH0                 1336
#define CM1CON1_CCH1                  1337
#define CCH11                         1338
#define CM1CON1_C1CH1                 1339
#define CM1CON1_CREF                  1340
#define CREF1                         1341
#define EVPOL01                       1342
#define CM1CON1_EVPOL                 1343
#define CM1CON1_EVPOL0                1344
#define CM1CON1_EVPOL1                1345
#define EVPOL11                       1346
#define CM1CON1_CPOL                  1347
#define CPOL1                         1348
#define COE1                          1349
#define CM1CON1_COE                   1350
#define CM1CON1_CON                   1351
#define CON1                          1352
#define REFOCON                       1353
#define RODIV0                        1354
#define RODIV                         1355
#define RODIV1                        1356
#define RODIV2                        1357
#define RODIV3                        1358
#define ROSEL                         1359
#define ROSSLP                        1360
#define ROON                          1361
#define OSCCON                        1362
#define SCS0                          1363
#define SCS                           1364
#define SCS1                          1365
#define OSTS                          1366
#define IRCF                          1367
#define IRCF0                         1368
#define IRCF1                         1369
#define IRCF2                         1370
#define IDLEN                         1371
#define T0CON                         1372
#define T0PS                          1373
#define T0PS0                         1374
#define T0PS1                         1375
#define T0PS2                         1376
#define PSA                           1377
#define T0PS3                         1378
#define T0SE                          1379
#define T0CS                          1380
#define T08BIT                        1381
#define TMR0ON                        1382
#define STATUS                        1383
#define C                             1384
#define CARRY                         1385
#define DC                            1386
#define ZERO                          1387
#define Z                             1388
#define OV                            1389
#define OVERFLOW                      1390
#define N                             1391
#define NEGATIVE                      1392
#define INTCON3                       1393
#define INT1IF                        1394
#define INT1F                         1395
#define INT2IF                        1396
#define INT2F                         1397
#define INT3F                         1398
#define INT3IF                        1399
#define INT1E                         1400
#define INT1IE                        1401
#define INT2IE                        1402
#define INT2E                         1403
#define INT3E                         1404
#define INT3IE                        1405
#define INT1P                         1406
#define INT1IP                        1407
#define INT2IP                        1408
#define INT2P                         1409
#define INTCON2                       1410
#define RBIP                          1411
#define INT3IP                        1412
#define INT3P                         1413
#define TMR0IP                        1414
#define T0IP                          1415
#define INTEDG3                       1416
#define INTEDG2                       1417
#define INTEDG1                       1418
#define INTEDG0                       1419
#define RBPU                          1420
#define NOT_RBPU                      1421
#define nRBPU                         1422
#define INTCON                        1423
#define RBIF                          1424
#define INT0F                         1425
#define INT0IF                        1426
#define T0IF                          1427
#define TMR0IF                        1428
#define RBIE                          1429
#define INT0E                         1430
#define INT0IE                        1431
#define T0IE                          1432
#define TMR0IE                        1433
#define PEIE                          1434
#define PEIE_GIEL                     1435
#define GIEL                          1436
#define GIE_GIEH                      1437
#define GIE                           1438
#define GIEH                          1439
#define STKPTR0                       1440
#define STKPTR                        1441
#define SP0                           1442
#define STKPTR1                       1443
#define SP1                           1444
#define STKPTR2                       1445
#define SP2                           1446
#define SP3                           1447
#define STKPTR3                       1448
#define STKPTR4                       1449
#define SP4                           1450
#define STKUNF                        1451
#define STKOVF                        1452
#define STKFUL                        1453

#endif // _PIC18F66J11_H_
